# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..IsEqual Method
RebarConstraint Class See Also
---
Returns true if the specified RebarConstraint is the same as 'this.' The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsEqual(
	RebarConstraint other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As RebarConstraint _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	RebarConstraint^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Structure..::..RebarConstraint
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | other is no longer valid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace